{"pageProps":{"postData":{"content":"<p>I've been using Sublime Text 3 for probably five years now and in that time I've discovered tons of useful tricks.</p>\n<p>I figured I should start writing them down for anyone who might be interested.</p>\n<p>I'll try to explain the bits that seem esoteric because there are a lot of cool commands which only work in certain contexts.</p>\n<h3>Package Control</h3>\n<p>Package Control makes it extremely easy to manage your Sublime packages. Also helps with discovering new ones, which is nice.</p>\n<h3>Goto Anything...</h3>\n<p>So you want to fly around your project super fast? Then the shortcut you want is <code>CMD+P</code>.<br>\nOnce you've opened the dialog try typing a filename.</p>\n<p>If you preface what you're typing with a <code>@</code> it will look for \"symbols\" in the current file.</p>\n<p>Ex: <code>@foobar</code>. But just typing <code>@</code> will give you a nice file outline. The definition of what a symbol is depends on the file-type. In a Markdown file, for instance, it will list every header. In a JavaScript or Ruby file it will list every method of an object.</p>\n<p>One last trick. If instead of an <code>@</code> you preface things with an : you can type a line number instead and hit enter to jump to that point. Ex: <code>:415</code></p>\n<p>There are other keyboard shortcuts for jumping to a line and going to a symbol but why bother when you can just use <code>CMD+P</code> and some easy prefixing.</p>\n<h3>Selections</h3>\n<p>There are some neat selections which come in handy depending on your context.<br>\nPersonally I use Expand Selection to Tag, <code>CMD+SHIFT+A</code> quite frequently when writing HTML.\nI also use Expand Selection to Line, <code>CMD+L</code> and Expand Selection to Word, <code>CMD+D</code> a lot.</p>\n","id":"sublime-text-3-tips","title":"Sublime Text 3 Tips","description":"I've been using Sublime Text 3 for probably four years now and in that time I've discovered tons of useful tricks. I figured I should start writing them down for anyone who might be interested. I'll try to explain the bits that seem esoteric because there are a lot of cool commands which only work in certain contexts.","date":"2019-04-16","image":"http://mauroreisvieira.com/static/og/sublime-text-3-tips.png"}},"__N_SSG":true}